<template>
    <h2>Страница не найдена</h2>

    <p>Возможно страница которую вы ищите была перемещена. Просим отнестись к этому с пониманием.</p>
    <p>Или она никогда не существовала.</p>
    <p>А как известно, существова́ние это аспект всякого сущего, в отличие от другого его аспекта — сущности. Сущность традиционно, начиная, как минимум, с эпохи Возрождения, исследуется научными дисциплинами. Традиционная наука пытается открыть сущность или субстанцию. Особенно в этом преуспела математика, для которой не так важно конкретное существование чего-либо, как возможности оперировать с сущностями. Вместе с тем, существование предполагает не отстранённый, абстрагированный взгляд на сущности, но делает акцент на их реальности. Таким образом, получается разрыв между абстрактными сущностями и экзистенциальной реальностью — существованием.</p>

    <p>Задумайтесь, вы смотрите сейчас в экран своего компьютера, планшета или смартфона.</p>
    <p>А вы там есть? Вы существуете? Можете доказать это? К примеру, этот сайт есть и он существует. Любой человек на планете земля может его увидеть сразу в тот же момент как пожелает... А вас может увидить любой человек сразу? То-то же...</p>

    <div class="d-flex">
        <div>
            <p>Вот и получается, что сайт есть, а вас нет.</p>

            <p> Но тем не менее, попробуйте поискать на главной странице или воспользоваться меню.
                Если и там вам не удастся найти искомое, то вам останется только посочувствовать.</p>
        </div>
        <div>
            <img src="../assets/img/freeman.png" alt="Логотип Vue.js" width="400" height="202" align="right"/>
        </div>
    </div>

</template>

<style  scoped>
    .d-flex {
        display: flex;
    }
    p {
        font-size: 1.1em;
    }
</style>

